Update SOLUTION (1).md
